# Напишите класс Fraction для работы с дробями. Пусть дробь в нашем классе предстает в виде числитель/знаменатель.
# Дробное число должно создаваться по запросу Fraction(a, b), где a – это числитель, а b – знаменатель дроби.

# Добавьте возможность сложения (сложения через оператор сложения) для дроби.
# Предполагается, что операция сложения может проводиться как только между дробями,
# так и между дробью и целым числом. Результат оперции должен быть представлен в виде дроби.

# Добавьте возможность взятия раздости (вычитания через оператор вычитания) для дробей.
# Предполагается, что операция вычитания может проводиться как только для двух дробей, так и для дроби и целого числа.
# Результат оперции должен быть представлен в виде дроби.

# Добавьте возможность умножения (умножения через оператор умножения) для дробей.
# Предполагается, что операция умножения может проводиться как только для двух дробей, так и для дроби и целого числа.
# Результат оперции должен быть представлен в виде дроби.

# Добавьте возможность приведения дроби к целому числу через стандартную функцию int().

# Добавьте возможность приведения дроби к числу с плавающей точкой через стандартную функцию float().

# Создайте дочерний класс OperationsOnFraction и добавьте туда собственные методы getint и getfloat,
# которые будут возвращять целую часть дроби и представление дроби в виде числа с плавающей точкой соответственно.

